package Random;

/**
 * Created by blinky on 21.01.15.
 */

//Направете интерфейс за предмети които могат да се продават Sellable.
//Направете класове за Телевизор, Мобилен телефон и Лаптоп, които имплементират интерфейса Sellable.
//Направете клас за пазарска кошника, който съдържа налична сума пари и лист от Sellable елементи.
//Направете метод Sell от пазарската кошника, който при недостатъчна наличност хрърля изключение от специално дефиниран за случая тип.

public interface Sellable {
    public void sell(int sale);

}

